Revit 2027 API
ExportPatternTable.GetPatternTableIterator Method
Returns a PatternTableIterator that iterates through the collection.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ExportPatternTableIterator GetPatternTableIterator()
Public Function GetPatternTableIterator As ExportPatternTableIterator
public:
ExportPatternTableIterator^ GetPatternTableIterator()
member GetPatternTableIterator : unit -> ExportPatternTableIterator
Return Value
ExportPatternTableIterator
A PatternTableIterator object that can be used to iterate through key-value pairs in the collection.
See Also
Reference
ExportPatternTable Class
Autodesk.Revit.DB Namespace